In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# NW File Path
giftdata = pd.read_csv('C:/Users/Nicole Wittlin.000/Documents/Classes/APRA Data Viz Challenge/Fundraising Data/giving_data_table.csv')

# MD File Path
#

In [3]:
# NW File Path
biodata = pd.read_csv('C:/Users/Nicole Wittlin.000/Documents/Classes/APRA Data Viz Challenge/Fundraising Data/bio_data_table.csv')

# MD File Path
#

In [6]:
# NW File Path
engagedata = pd.read_csv('C:/Users/Nicole Wittlin.000/Documents/Classes/APRA Data Viz Challenge/Fundraising Data/engagement_data_table.csv')

# MD File Path

In [7]:
giftdata.head()

   household ID       ID  gift id  credit Type  gift amt   gift date
0       4986394  5539534  2921084  Soft-Credit       476  2019-08-24
1       8553925  6099545  2921123  Hard-Credit     20086  2016-12-20
2       8553925  2847749  2921123  Soft-Credit      1258  2019-08-13
3       9623708  9705490  2921222  Hard-Credit     30377  2017-04-08
4       9623708  1758068  2921222  Soft-Credit       956  2018-04-26

In [8]:
biodata.head()

,id,name,household_id,country,city,birthday,deceased,zip,state,lat,lon,capacity,capacity_source,race
0,5961718,"Smith, Katalina",1000259,United States,Lumberton,1924-06-11,Y,28358.0,NC,34.63,-79.01,$50k - $75K,screening,Black or African American
1,5443595,"el-Niazi, Khaleel",1000279,United States,West chester,1924-07-08,Y,19382.0,PA,39.95,-75.60,$2.5k - $5k,screening,Non-Hispanic white
2,3946937,"al-Dib, Mutlaq",1000279,United States,Ronkonkoma,NaN,Y,11779.0,NY,40.80,-73.12,$2.5k - $5k,institutional,Two or more races
3,4129813,"Black, Jonathan",1000308,United States,Columbus,NaN,Y,43207.0,OH,39.98,-82.98,$250k - $500k,institutional,Non-Hispanic white
4,7813954,"Atencio, Rebecca",1000308,United States,De pere,1919-04-07,Y,54115.0,WI,44.43,-88.07,$75k - $100k,screening,Non-Hispanic white

In [9]:
engagedata.head()

,id,last_contact,numer_of_contacts,gift_officer,event,volunteer,time_on_site,interests
0,5961718,NaN,0.0,NaN,N,0.0,79.0,NaN
1,3362879,NaN,0.0,"Shazier, Daliyah",Y,1.0,NaN,"sports,travel"
2,2307732,NaN,0.0,NaN,Y,NaN,NaN,NaN
3,1793412,NaN,NaN,NaN,N,NaN,851.0,NaN
4,4818692,2018-09-06,0.0,NaN,N,NaN,NaN,NaN

In [10]:
from pandas_profiling import ProfileReport

In [ ]:
#profFull = ProfileReport(df)
#profFull.to_file(output_file='output.html')